Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/atdf/PIC32CX1025SG61100.atdf
        <register name="HC1R" offset="0x28" rw="RW" size="1" initval="0xE00" caption="Host Control 1">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield modes="DEFAULT" name="LEDCTRL" caption="LED Control" mask="0x1" values="SDHC_HC1R__LEDCTRL"/>
          <bitfield name="DW" caption="Data Width" mask="0x2" values="SDHC_HC1R__DW"/>
          <bitfield name="HSEN" caption="High Speed Enable" mask="0x4" values="SDHC_HC1R__HSEN"/>
          <bitfield name="DMASEL" caption="DMA Select" mask="0x18" values="SDHC_HC1R__DMASEL"/>
          <bitfield modes="DEFAULT" name="CARDDTL" caption="Card Detect Test Level" mask="0x40" values="SDHC_HC1R__CARDDTL"/>
          <bitfield modes="DEFAULT" name="CARDDSEL" caption="Card Detect Signal Selection" mask="0x80" values="SDHC_HC1R__CARDDSEL"/>
        </register>
        <register name="PCR" offset="0x29" rw="RW" size="1" initval="0x0E" caption="Power Control">
          <bitfield name="SDBPWR" caption="SD Bus Power" mask="0x1" values="SDHC_PCR__SDBPWR"/>
          <bitfield name="SDBVSEL" caption="SD Bus Voltage Select" mask="0xE" values="SDHC_PCR__SDBVSEL"/>
        </register>
        <register name="BGCR" offset="0x2A" rw="RW" size="1" initval="0x00" caption="Block Gap Control">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="STPBGR" caption="Stop at Block Gap Request" mask="0x1" values="SDHC_BGCR__STPBGR"/>
          <bitfield name="CONTR" caption="Continue Request" mask="0x2" values="SDHC_BGCR__CONTR"/>
          <bitfield modes="DEFAULT" name="RWCTRL" caption="Read Wait Control" mask="0x4" values="SDHC_BGCR__RWCTRL"/>
          <bitfield modes="DEFAULT" name="INTBG" caption="Interrupt at Block Gap" mask="0x8" values="SDHC_BGCR__INTBG"/>
        </register>
        <register name="WCR" offset="0x2B" rw="RW" size="1" initval="0x00" caption="Wakeup Control">
          <bitfield name="WKENCINT" caption="Wakeup Event Enable on Card Interrupt" mask="0x1" values="SDHC_WCR__WKENCINT"/>
          <bitfield name="WKENCINS" caption="Wakeup Event Enable on Card Insertion" mask="0x2" values="SDHC_WCR__WKENCINS"/>
          <bitfield name="WKENCREM" caption="Wakeup Event Enable on Card Removal" mask="0x4" values="SDHC_WCR__WKENCREM"/>
        </register>
        <register name="CCR" offset="0x2C" rw="RW" size="2" initval="0x0000" caption="Clock Control">
          <bitfield name="INTCLKEN" caption="Internal Clock Enable" mask="0x1" values="SDHC_CCR__INTCLKEN"/>
          <bitfield name="INTCLKS" caption="Internal Clock Stable" mask="0x2" values="SDHC_CCR__INTCLKS"/>
          <bitfield name="SDCLKEN" caption="SD Clock Enable" mask="0x4" values="SDHC_CCR__SDCLKEN"/>
          <bitfield name="CLKGSEL" caption="Clock Generator Select" mask="0x20" values="SDHC_CCR__CLKGSEL"/>
          <bitfield name="USDCLKFSEL" caption="Upper Bits of SDCLK Frequency Select" mask="0xC0"/>
          <bitfield name="SDCLKFSEL" caption="SDCLK Frequency Select" mask="0xFF00"/>
        </register>
        <register name="TCR" offset="0x2E" rw="RW" size="1" initval="0x00" caption="Timeout Control">
          <bitfield name="DTCVAL" caption="Data Timeout Counter Value" mask="0xF"/>
        </register>
        <register name="SRR" offset="0x2F" rw="RW" size="1" initval="0x00" caption="Software Reset">
          <bitfield name="SWRSTALL" caption="Software Reset For All" mask="0x1" values="SDHC_SRR__SWRSTALL"/>
          <bitfield name="SWRSTCMD" caption="Software Reset For CMD Line" mask="0x2" values="SDHC_SRR__SWRSTCMD"/>
          <bitfield name="SWRSTDAT" caption="Software Reset For DAT Line" mask="0x4" values="SDHC_SRR__SWRSTDAT"/>
        </register>
        <register name="NISTR" offset="0x30" rw="RW" size="2" initval="0x0000" caption="Normal Interrupt Status">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDC" caption="Command Complete" mask="0x1" values="SDHC_NISTR__CMDC"/>
          <bitfield name="TRFC" caption="Transfer Complete" mask="0x2" values="SDHC_NISTR__TRFC"/>
          <bitfield name="BLKGE" caption="Block Gap Event" mask="0x4" values="SDHC_NISTR__BLKGE"/>
          <bitfield name="DMAINT" caption="DMA Interrupt" mask="0x8" values="SDHC_NISTR__DMAINT"/>
          <bitfield name="BWRRDY" caption="Buffer Write Ready" mask="0x10" values="SDHC_NISTR__BWRRDY"/>
          <bitfield name="BRDRDY" caption="Buffer Read Ready" mask="0x20" values="SDHC_NISTR__BRDRDY"/>
          <bitfield modes="DEFAULT" name="CINS" caption="Card Insertion" mask="0x40" values="SDHC_NISTR__CINS"/>
          <bitfield modes="DEFAULT" name="CREM" caption="Card Removal" mask="0x80" values="SDHC_NISTR__CREM"/>
          <bitfield modes="DEFAULT" name="CINT" caption="Card Interrupt" mask="0x100" values="SDHC_NISTR__CINT"/>
          <bitfield modes="EMMC" name="BOOTAR" caption="Boot Acknowledge Received" mask="0x4000"/>
          <bitfield name="ERRINT" caption="Error Interrupt" mask="0x8000" values="SDHC_NISTR__ERRINT"/>
        </register>
        <register name="EISTR" offset="0x32" rw="RW" size="2" initval="0x0000" caption="Error Interrupt Status">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDTEO" caption="Command Timeout Error" mask="0x1" values="SDHC_EISTR__CMDTEO"/>
          <bitfield name="CMDCRC" caption="Command CRC Error" mask="0x2" values="SDHC_EISTR__CMDCRC"/>
          <bitfield name="CMDEND" caption="Command End Bit Error" mask="0x4" values="SDHC_EISTR__CMDEND"/>
          <bitfield name="CMDIDX" caption="Command Index Error" mask="0x8" values="SDHC_EISTR__CMDIDX"/>
          <bitfield name="DATTEO" caption="Data Timeout Error" mask="0x10" values="SDHC_EISTR__DATTEO"/>
          <bitfield name="DATCRC" caption="Data CRC Error" mask="0x20" values="SDHC_EISTR__DATCRC"/>
          <bitfield name="DATEND" caption="Data End Bit Error" mask="0x40" values="SDHC_EISTR__DATEND"/>
          <bitfield name="CURLIM" caption="Current Limit Error" mask="0x80" values="SDHC_EISTR__CURLIM"/>
          <bitfield name="ACMD" caption="Auto CMD Error" mask="0x100" values="SDHC_EISTR__ACMD"/>
          <bitfield name="ADMA" caption="ADMA Error" mask="0x200" values="SDHC_EISTR__ADMA"/>
          <bitfield modes="EMMC" name="BOOTAE" caption="Boot Acknowledge Error" mask="0x1000" values="SDHC_EISTR__BOOTAE"/>
        </register>
        <register name="NISTER" offset="0x34" rw="RW" size="2" initval="0x0000" caption="Normal Interrupt Status Enable">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDC" caption="Command Complete Status Enable" mask="0x1" values="SDHC_NISTER__CMDC"/>
          <bitfield name="TRFC" caption="Transfer Complete Status Enable" mask="0x2" values="SDHC_NISTER__TRFC"/>
          <bitfield name="BLKGE" caption="Block Gap Event Status Enable" mask="0x4" values="SDHC_NISTER__BLKGE"/>
          <bitfield name="DMAINT" caption="DMA Interrupt Status Enable" mask="0x8" values="SDHC_NISTER__DMAINT"/>
          <bitfield name="BWRRDY" caption="Buffer Write Ready Status Enable" mask="0x10" values="SDHC_NISTER__BWRRDY"/>
          <bitfield name="BRDRDY" caption="Buffer Read Ready Status Enable" mask="0x20" values="SDHC_NISTER__BRDRDY"/>
          <bitfield modes="DEFAULT" name="CINS" caption="Card Insertion Status Enable" mask="0x40" values="SDHC_NISTER__CINS"/>
          <bitfield modes="DEFAULT" name="CREM" caption="Card Removal Status Enable" mask="0x80" values="SDHC_NISTER__CREM"/>
          <bitfield modes="DEFAULT" name="CINT" caption="Card Interrupt Status Enable" mask="0x100" values="SDHC_NISTER__CINT"/>
          <bitfield modes="EMMC" name="BOOTAR" caption="Boot Acknowledge Received Status Enable" mask="0x4000"/>
        </register>
        <register name="EISTER" offset="0x36" rw="RW" size="2" initval="0x0000" caption="Error Interrupt Status Enable">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDTEO" caption="Command Timeout Error Status Enable" mask="0x1" values="SDHC_EISTER__CMDTEO"/>
          <bitfield name="CMDCRC" caption="Command CRC Error Status Enable" mask="0x2" values="SDHC_EISTER__CMDCRC"/>
          <bitfield name="CMDEND" caption="Command End Bit Error Status Enable" mask="0x4" values="SDHC_EISTER__CMDEND"/>
          <bitfield name="CMDIDX" caption="Command Index Error Status Enable" mask="0x8" values="SDHC_EISTER__CMDIDX"/>
          <bitfield name="DATTEO" caption="Data Timeout Error Status Enable" mask="0x10" values="SDHC_EISTER__DATTEO"/>
          <bitfield name="DATCRC" caption="Data CRC Error Status Enable" mask="0x20" values="SDHC_EISTER__DATCRC"/>
          <bitfield name="DATEND" caption="Data End Bit Error Status Enable" mask="0x40" values="SDHC_EISTER__DATEND"/>
          <bitfield name="CURLIM" caption="Current Limit Error Status Enable" mask="0x80" values="SDHC_EISTER__CURLIM"/>
          <bitfield name="ACMD" caption="Auto CMD Error Status Enable" mask="0x100" values="SDHC_EISTER__ACMD"/>
          <bitfield name="ADMA" caption="ADMA Error Status Enable" mask="0x200" values="SDHC_EISTER__ADMA"/>
          <bitfield modes="EMMC" name="BOOTAE" caption="Boot Acknowledge Error Status Enable" mask="0x1000"/>
        </register>
        <register name="NISIER" offset="0x38" rw="RW" size="2" initval="0x0000" caption="Normal Interrupt Signal Enable">
          <mode name="DEFAULT" caption="SD_SDIO"/>
          <mode name="EMMC"/>
          <bitfield name="CMDC" caption="Command Complete Signal Enable" mask="0x1" values="SDHC_NISIER__CMDC"/>
          <bitfield name="TRFC" caption="Transfer Complete Signal Enable" mask="0x2" values="SDHC_NISIER__TRFC"/>
          <bitfield name="BLKGE" caption="Block Gap Event Signal Enable" mask="0x4" values="SDHC_NISIER__BLKGE"/>
          <bitfield name="DMAINT" caption="DMA Interrupt Signal Enable" mask="0x8" values="SDHC_NISIER__DMAINT"/>
          <bitfield name="BWRRDY" caption="Buffer Write Ready Signal Enable" mask="0x10" values="SDHC_NISIER__BWRRDY"/>
          <bitfield name="BRDRDY" caption="Buffer Read Ready Signal Enable" mask="0x20" values="SDHC_NISIER__BRDRDY"/>
          <bitfield modes="DEFAULT" name="CINS" caption="Card Insertion Signal Enable" mask="0x40" values="SDHC_NISIER__CINS"/>
          <bitfield modes="DEFAULT" name="CREM" caption="Card Removal Signal Enable" mask="0x80" values="SDHC_NISIER__CREM"/>
          <bitfield modes="DEFAULT" name="CINT" caption="Card Interrupt Signal Enable" mask="0x100" values="SDHC_NISIER__CINT"/>
          <bitfield modes="EMMC" name="BOOTAR" caption="Boot Acknowledge Received Signal Enable" mask="0x4000"/>
        </register>
