Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/atdf/PIC32CX1025SG61100.atdf
        <register name="ASAR" offset="0x58" rw="RW" size="4" count="1" initval="0x00000000" caption="ADMA System Address">
          <bitfield name="ADMASA" caption="ADMA System Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="PVR" offset="0x60" rw="RW" size="2" count="8" initval="0x0000" caption="Preset Value n">
          <bitfield name="SDCLKFSEL" caption="SDCLK Frequency Select Value for Initialization" mask="0x3FF"/>
          <bitfield name="CLKGSEL" caption="Clock Generator Select Value for Initialization" mask="0x400" values="SDHC_PVR__CLKGSEL"/>
          <bitfield name="DRVSEL" caption="Driver Strength Select Value for Initialization" mask="0xC000" values="SDHC_PVR__DRVSEL"/>
        </register>
        <register name="SISR" offset="0xFC" rw="R" size="2" initval="0x20000" caption="Slot Interrupt Status">
          <bitfield name="INTSSL" caption="Interrupt Signal for Each Slot" mask="0x1"/>
        </register>
        <register name="HCVR" offset="0xFE" rw="R" size="2" initval="0x1802" caption="Host Controller Version">
          <bitfield name="SVER" caption="Spec Version" mask="0xFF"/>
          <bitfield name="VVER" caption="Vendor Version" mask="0xFF00"/>
        </register>
        <register name="MC1R" offset="0x204" rw="RW" size="1" initval="0x00" caption="MMC Control 1">
          <bitfield name="CMDTYP" caption="e.MMC Command Type" mask="0x3" values="SDHC_MC1R__CMDTYP"/>
          <bitfield name="DDR" caption="e.MMC HSDDR Mode" mask="0x8"/>
          <bitfield name="OPD" caption="e.MMC Open Drain Mode" mask="0x10"/>
          <bitfield name="BOOTA" caption="e.MMC Boot Acknowledge Enable" mask="0x20"/>
          <bitfield name="RSTN" caption="e.MMC Reset Signal" mask="0x40"/>
          <bitfield name="FCD" caption="e.MMC Force Card Detect" mask="0x80"/>
        </register>
        <register name="MC2R" offset="0x205" rw="W" size="1" initval="0x00" caption="MMC Control 2">
          <bitfield name="SRESP" caption="e.MMC Abort Wait IRQ" mask="0x1"/>
          <bitfield name="ABOOT" caption="e.MMC Abort Boot" mask="0x2"/>
        </register>
        <register name="ACR" offset="0x208" rw="RW" size="4" initval="0x00000000" caption="AHB Control">
          <bitfield name="BMAX" caption="AHB Maximum Burst" mask="0x3" values="SDHC_ACR__BMAX"/>
        </register>
        <register name="CC2R" offset="0x20C" rw="RW" size="4" initval="0x00000000" caption="Clock Control 2">
          <bitfield name="FSDCLKD" caption="Force SDCK Disabled" mask="0x1" values="SDHC_CC2R__FSDCLKD"/>
        </register>
        <register name="CACR" offset="0x230" rw="RW" size="4" initval="0x00000000" caption="Capabilities Control">
          <bitfield name="CAPWREN" caption="Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)" mask="0x1"/>
          <bitfield name="KEY" caption="Key (0x46)" mask="0xFF00" values="SDHC_CACR__KEY"/>
        </register>
        <register name="DBGR" offset="0x234" rw="RW" size="1" initval="0x00" caption="Debug">
          <bitfield name="NIDBG" caption="Non-intrusive debug enable" mask="0x1" values="SDHC_DBGR__NIDBG"/>
        </register>
      </register-group>
      <value-group name="SDHC_BSR__BOUNDARY">
        <value name="4K" caption="4k bytes" value="0"/>
        <value name="8K" caption="8k bytes" value="1"/>
        <value name="16K" caption="16k bytes" value="2"/>
        <value name="32K" caption="32k bytes" value="3"/>
        <value name="64K" caption="64k bytes" value="4"/>
        <value name="128K" caption="128k bytes" value="5"/>
        <value name="256K" caption="256k bytes" value="6"/>
        <value name="512K" caption="512k bytes" value="7"/>
      </value-group>
      <value-group name="SDHC_TMR__ACMDEN">
        <value name="DISABLED" caption="Auto Command Disabled" value="0"/>
        <value name="CMD12" caption="Auto CMD12 Enable" value="1"/>
        <value name="CMD23" caption="Auto CMD23 Enable" value="2"/>
      </value-group>
      <value-group name="SDHC_TMR__BCEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="SDHC_TMR__DMAEN">
        <value name="DISABLE" caption="No data transfer or Non DMA data transfer" value="0"/>
        <value name="ENABLE" caption="DMA data transfer" value="1"/>
      </value-group>
      <value-group name="SDHC_TMR__DTDSEL">
        <value name="WRITE" caption="Write (Host to Card)" value="0"/>
        <value name="READ" caption="Read (Card to Host)" value="1"/>
      </value-group>
      <value-group name="SDHC_TMR__MSBSEL">
        <value name="SINGLE" caption="Single Block" value="0"/>
        <value name="MULTIPLE" caption="Multiple Block" value="1"/>
      </value-group>
      <value-group name="SDHC_CR__CMDCCEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="SDHC_CR__CMDICEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="SDHC_CR__CMDTYP">
        <value name="NORMAL" caption="Other commands" value="0"/>
        <value name="SUSPEND" caption="CMD52 for writing Bus Suspend in CCCR" value="1"/>
        <value name="RESUME" caption="CMD52 for writing Function Select in CCCR" value="2"/>
        <value name="ABORT" caption="CMD12, CMD52 for writing I/O Abort in CCCR" value="3"/>
      </value-group>
      <value-group name="SDHC_CR__DPSEL">
        <value name="NO_DATA" caption="No Data Present" value="0"/>
        <value name="DATA" caption="Data Present" value="1"/>
      </value-group>
      <value-group name="SDHC_CR__RESPTYP">
        <value name="NONE" caption="No response" value="0"/>
        <value name="136_BIT" caption="136-bit response" value="1"/>
        <value name="48_BIT" caption="48-bit response" value="2"/>
        <value name="48_BIT_BUSY" caption="48-bit response check busy after response" value="3"/>
      </value-group>
      <value-group name="SDHC_PSR__BUFRDEN">
        <value name="DISABLE" caption="Read disable" value="0"/>
        <value name="ENABLE" caption="Read enable" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__BUFWREN">
        <value name="DISABLE" caption="Write disable" value="0"/>
        <value name="ENABLE" caption="Write enable" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__CARDDPL">
        <value name="NO" caption="No card present (SDCD#=1)" value="0"/>
        <value name="YES" caption="Card present (SDCD#=0)" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__CARDINS">
        <value name="NO" caption="Reset or Debouncing or No Card" value="0"/>
        <value name="YES" caption="Card inserted" value="1"/>
      </value-group>
