Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/atdf/PIC32CX1025SG61100.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP100" caption="TQFP100">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PC00"/>
      <pin position="4" pad="PC01"/>
      <pin position="5" pad="PC02"/>
      <pin position="6" pad="PC03"/>
      <pin position="7" pad="PA02"/>
      <pin position="8" pad="PA03"/>
      <pin position="9" pad="PB04"/>
      <pin position="10" pad="PB05"/>
      <pin position="11" pad="AVSS"/>
      <pin position="12" pad="AVDD"/>
      <pin position="13" pad="PB06"/>
      <pin position="14" pad="PB07"/>
      <pin position="15" pad="PB08"/>
      <pin position="16" pad="PB09"/>
      <pin position="17" pad="PA04"/>
      <pin position="18" pad="PA05"/>
      <pin position="19" pad="PA06"/>
      <pin position="20" pad="PA07"/>
      <pin position="21" pad="PC05"/>
      <pin position="22" pad="PC06"/>
      <pin position="23" pad="PC07"/>
      <pin position="24" pad="VSS"/>
      <pin position="25" pad="VDD"/>
      <pin position="26" pad="PA08"/>
      <pin position="27" pad="PA09"/>
      <pin position="28" pad="PA10"/>
      <pin position="29" pad="PA11"/>
      <pin position="30" pad="VDD"/>
      <pin position="31" pad="VSS"/>
      <pin position="32" pad="PB10"/>
      <pin position="33" pad="PB11"/>
      <pin position="34" pad="PB12"/>
      <pin position="35" pad="PB13"/>
      <pin position="36" pad="PB14"/>
      <pin position="37" pad="PB15"/>
      <pin position="38" pad="VSS"/>
      <pin position="39" pad="VDD"/>
      <pin position="40" pad="PC10"/>
      <pin position="41" pad="PC11"/>
      <pin position="42" pad="PC12"/>
      <pin position="43" pad="PC13"/>
      <pin position="44" pad="PC14"/>
      <pin position="45" pad="PC15"/>
      <pin position="46" pad="PA12"/>
      <pin position="47" pad="PA13"/>
      <pin position="48" pad="PA14"/>
      <pin position="49" pad="PA15"/>
      <pin position="50" pad="VSS"/>
      <pin position="51" pad="VDD"/>
      <pin position="52" pad="PA16"/>
      <pin position="53" pad="PA17"/>
      <pin position="54" pad="PA18"/>
      <pin position="55" pad="PA19"/>
      <pin position="56" pad="PC16"/>
      <pin position="57" pad="PC17"/>
      <pin position="58" pad="PC18"/>
      <pin position="59" pad="PC19"/>
      <pin position="60" pad="PC20"/>
      <pin position="61" pad="PC21"/>
      <pin position="62" pad="VSS"/>
      <pin position="63" pad="VDD"/>
      <pin position="64" pad="PB16"/>
      <pin position="65" pad="PB17"/>
      <pin position="66" pad="PB18"/>
      <pin position="67" pad="PB19"/>
      <pin position="68" pad="PB20"/>
      <pin position="69" pad="PB21"/>
      <pin position="70" pad="PA20"/>
      <pin position="71" pad="PA21"/>
      <pin position="72" pad="PA22"/>
      <pin position="73" pad="PA23"/>
      <pin position="74" pad="PA24"/>
      <pin position="75" pad="PA25"/>
      <pin position="76" pad="VSS"/>
      <pin position="77" pad="VDD"/>
      <pin position="78" pad="PB22"/>
      <pin position="79" pad="PB23"/>
      <pin position="80" pad="PB24"/>
      <pin position="81" pad="PB25"/>
      <pin position="82" pad="PC24"/>
      <pin position="83" pad="PC25"/>
      <pin position="84" pad="PC26"/>
      <pin position="85" pad="PC27"/>
      <pin position="86" pad="PC28"/>
      <pin position="87" pad="PA27"/>
      <pin position="88" pad="RESET_N"/>
      <pin position="89" pad="VDDCORE"/>
      <pin position="90" pad="VSS"/>
      <pin position="91" pad="VSW"/>
      <pin position="92" pad="VDD"/>
      <pin position="93" pad="PA30"/>
      <pin position="94" pad="PA31"/>
      <pin position="95" pad="PB30"/>
      <pin position="96" pad="PB31"/>
      <pin position="97" pad="PB00"/>
      <pin position="98" pad="PB01"/>
      <pin position="99" pad="PB02"/>
      <pin position="100" pad="PB03"/>
      <pin position="MOSI" pad="PB26" type="INTERNAL_101"/>
      <pin position="SCK" pad="PB27" type="INTERNAL_102"/>
      <pin position="MISO" pad="PB28" type="INTERNAL_103"/>
      <pin position="CS" pad="PB29" type="INTERNAL_104"/>
      <pin position="GPIO" pad="PC04" type="INTERNAL_105"/>
    </pinout>
    <pinout name="TFBGA100" caption="TFBGA100">
      <pin position="A1" pad="PB30"/>
      <pin position="A2" pad="VSS"/>
      <pin position="A3" pad="VDD"/>
      <pin position="A4" pad="VSW"/>
      <pin position="A5" pad="VDDCORE"/>
      <pin position="A6" pad="PC27"/>
      <pin position="A7" pad="PC26"/>
      <pin position="A8" pad="VSS"/>
      <pin position="A9" pad="VDD"/>
      <pin position="A10" pad="PA20"/>
      <pin position="B1" pad="PC03"/>
      <pin position="B2" pad="PB03"/>
      <pin position="B3" pad="PB01"/>
      <pin position="B4" pad="PB00"/>
      <pin position="B5" pad="PA30"/>
      <pin position="B6" pad="PC28"/>
      <pin position="B7" pad="PC25"/>
      <pin position="B8" pad="PB23"/>
      <pin position="B9" pad="PB22"/>
      <pin position="B10" pad="PA22"/>
      <pin position="C1" pad="PB04"/>
      <pin position="C2" pad="PC00"/>
      <pin position="C3" pad="PB31"/>
      <pin position="C4" pad="PA31"/>
      <pin position="C5" pad="RESET_N"/>
      <pin position="C6" pad="PA27"/>
      <pin position="C7" pad="PC24"/>
      <pin position="C8" pad="PB24"/>
      <pin position="C9" pad="PA23"/>
      <pin position="C10" pad="PA25"/>
      <pin position="D1" pad="PB07"/>
      <pin position="D2" pad="PA00"/>
      <pin position="D3" pad="PC01"/>
      <pin position="D4" pad="PB02"/>
      <pin position="D5" pad="VDD"/>
      <pin position="D6" pad="VSS"/>
      <pin position="D7" pad="PB25"/>
      <pin position="D8" pad="PB20"/>
      <pin position="D9" pad="PB17"/>
      <pin position="D10" pad="PA24"/>
      <pin position="E1" pad="PB09"/>
      <pin position="E2" pad="PA01"/>
      <pin position="E3" pad="PC02"/>
      <pin position="E4" pad="VSS"/>
      <pin position="E5" pad="VDD"/>
      <pin position="E6" pad="PC21"/>
      <pin position="E7" pad="PB19"/>
      <pin position="E8" pad="PB21"/>
      <pin position="E9" pad="PB16"/>
      <pin position="E10" pad="PA19"/>
      <pin position="F1" pad="PA04"/>
      <pin position="F2" pad="PA02"/>
      <pin position="F3" pad="PB05"/>
      <pin position="F4" pad="PA03"/>
      <pin position="F5" pad="PB12"/>
      <pin position="F6" pad="PC11"/>
      <pin position="F7" pad="PB18"/>
      <pin position="F8" pad="PA21"/>
      <pin position="F9" pad="VSS"/>
      <pin position="F10" pad="VDD"/>
      <pin position="G1" pad="PA05"/>
      <pin position="G2" pad="PB06"/>
      <pin position="G3" pad="AVSS"/>
      <pin position="G4" pad="AVDD"/>
      <pin position="G5" pad="PB13"/>
      <pin position="G6" pad="PC12"/>
      <pin position="G7" pad="PC18"/>
      <pin position="G8" pad="PC19"/>
      <pin position="G9" pad="PC20"/>
      <pin position="G10" pad="PA18"/>
      <pin position="H1" pad="PA07"/>
      <pin position="H2" pad="PA06"/>
      <pin position="H3" pad="PB08"/>
      <pin position="H4" pad="VSS"/>
      <pin position="H5" pad="VDD"/>
      <pin position="H6" pad="PC13"/>
      <pin position="H7" pad="PC14"/>
      <pin position="H8" pad="PC17"/>
      <pin position="H9" pad="PC16"/>
      <pin position="H10" pad="PA17"/>
      <pin position="J1" pad="PC05"/>
      <pin position="J2" pad="PC06"/>
      <pin position="J3" pad="PA09"/>
      <pin position="J4" pad="PA11"/>
      <pin position="J5" pad="PB10"/>
      <pin position="J6" pad="PB14"/>
      <pin position="J7" pad="PA14"/>
      <pin position="J8" pad="PA15"/>
      <pin position="J9" pad="PA16"/>
      <pin position="J10" pad="VSS"/>
      <pin position="K1" pad="PC07"/>
      <pin position="K2" pad="PA10"/>
      <pin position="K3" pad="PA08"/>
      <pin position="K4" pad="PB11"/>
      <pin position="K5" pad="PB15"/>
      <pin position="K6" pad="PC10"/>
      <pin position="K7" pad="PC15"/>
      <pin position="K8" pad="PA13"/>
      <pin position="K9" pad="PA12"/>
      <pin position="K10" pad="VDD"/>
      <pin position="MOSI" pad="PB26" type="INTERNAL_L1"/>
      <pin position="SCK" pad="PB27" type="INTERNAL_L2"/>
      <pin position="MISO" pad="PB28" type="INTERNAL_L3"/>
      <pin position="CS" pad="PB29" type="INTERNAL_L4"/>
      <pin position="GPIO" pad="PC04" type="INTERNAL_L5"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
